# Enable homebrew services
tap "homebrew/services"

# Essentials
brew "git"
brew "zsh"

# Basic unix tools
brew "curl"
brew "gawk"
brew "gnu-tar"
brew "wget"

# Modern unix tools
brew "z"

# Package Managers
brew "mise"

# PHP
brew "composer"
brew "php"

# Laravel valet dependencies
brew "dnsmasq"
brew "nginx"

# Databases
brew "pgcli"
brew "postgresql@16"

# Applications
cask "visual-studio-code"
cask "wezterm"
