# Enable homebrew services
tap "homebrew/services"

# Applications
cask "gnucash"
cask "google-chrome"
cask "microsoft-office"
cask "spotify"

# Comms
cask "discord"
cask "microsoft-teams"
cask "slack"
cask "whatsapp"
cask "zoom"

# Dev tools
brew "lazydocker"
cask "docker"
cask "kitty"
cask "postman"
cask "visual-studio-code"

# Essentials
brew "git"
brew "git-lfs"
brew "nvim"
brew "tmux"
brew "tmuxp"
brew "zsh"

# Basic unix tools
brew "coreutils"
brew "curl"
brew "direnv"
brew "gawk"
brew "gcc"
brew "gnu-tar"
brew "gpg"
brew "tree"
brew "wget"

# Modern unix tools
brew "bat"
brew "dust"
brew "eza"
brew "fd"
brew "htop"
brew "httpie"
brew "jq"
brew "ripgrep"
brew "z"

# Productivity
brew "starship"
cask "hammerspoon"
cask "karabiner-elements"
cask "raycast"

# Cloud
brew "act"
brew "aws-vault"
brew "awscli"
brew "flyctl"
brew "gh"
brew "k9s"
brew "localstack"
brew "rclone"

# Non-asdf languages
brew "composer"
brew "php"

# Erlang dependencies
brew "autoconf"
brew "fop"
brew "libxslt"
brew "openssl"
brew "wxwidgets"

# Rails dependencies
brew "libpq"

# Database and extensions
brew "gmp"
brew "postgresql@16"

# Fonts
tap "homebrew/cask-fonts"

cask "font-inconsolata-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-iosevka-term-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-roboto-mono-nerd-font"

# Image and PDF manipulation
brew "exiftool"
brew "ghostscript"
brew "imagemagick"
brew "mupdf"
brew "poppler"
cask "basictex"

# Video editing & player
brew "ffmpeg"
brew "yt-dlp"
cask "obs"
cask "vlc"

# VSCode appearance
vscode "atommaterial.a-file-icon-vscode"
vscode "equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "nikoskornarakis.predawn-twilight"

# VSCode Behaviour
vscode "formulahendry.auto-rename-tag"
vscode "vincaslt.highlight-matching-tag"

# VSCode Tools
vscode "editorconfig.editorconfig"
vscode "ms-vsliveshare.vsliveshare"
vscode "vscodevim.vim"

# VSCode HTML & CSS
vscode "bradlc.vscode-tailwindcss"
vscode "esbenp.prettier-vscode"
vscode "zignd.html-css-class-completion"

# VSCode Elixir
vscode "jakebecker.elixir-ls"
vscode "phoenixframework.phoenix"
vscode "vscode-exunit.exunit"

# VSCode PHP & Laravel
vscode "amiralizadeh9480.laravel-extra-intellisense"
vscode "bmewburn.vscode-intelephense-client"
vscode "calebporzio.better-phpunit"
vscode "codingyu.laravel-goto-view"
vscode "devsense.composer-php-vscode"
vscode "devsense.profiler-php-vscode"
vscode "ihunte.laravel-blade-wrapper"
vscode "naoray.laravel-goto-components"
vscode "onecentlin.laravel-blade"
vscode "onecentlin.laravel5-snippets"
vscode "shufo.vscode-blade-formatter"
