# Applications
cask "spotify"
cask "google-chrome"
cask "gnucash"
cask "keybase"
cask "microsoft-office"
cask "omnifocus"

# Comms
cask "discord"
cask "microsoft-teams"
cask "slack"
cask "skype"
cask "telegram"
cask "whatsapp"
cask "zoom"

# Dev tools
cask "docker"
cask "karabiner-elements"
cask "kitty"
cask "postman"
cask "rowanj-gitx"
cask "visual-studio-code"

# Productivity
cask "hammerspoon"
cask "raycast"

# Essentials
brew "nvim"
brew "tmux"
brew "coreutils"
brew "gnu-tar"
brew "git"
brew "gpg"
brew "curl"
brew "wget"

# Modern unix tools
brew "bat"
brew "httpie"
brew "z"
brew "exa"
brew "ripgrep"
brew "fd"

# Erlang dependencies
brew "openssl@1.1"
brew "wxwidgets"

# Rails needs libpq >= 11.1
brew "libpq"

# Dev CLI tools
brew "awscli"
brew "docker-compose"
brew "flyctl"
brew "gh"
brew "localstack"
brew "starship"
brew "teleport"
brew "kubectl"
brew "k9s"

# Fonts
tap "homebrew/cask-fonts"
cask "font-iosevka-nerd-font"
cask "font-iosevka-term-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-roboto-mono-nerd-font"

# Video editing & player
brew "ffmpeg"
brew "youtube-dl"
cask "vlc"
