# Applications
cask "spotify"
cask "google-chrome"
cask "gnucash"
cask "keybase"
cask "microsoft-office"
cask "omnifocus"

# Comms
cask "discord"
cask "microsoft-teams"
cask "slack"
cask "skype"
cask "telegram"
cask "whatsapp"
cask "zoom"

# Dev tools
cask "docker"
cask "kitty"
cask "postman"
cask "visual-studio-code"

# Essentials
brew "nvim"
brew "tmux"
brew "git"
brew "git-lfs"
brew "zsh"

# Basic unix tools
brew "coreutils"
brew "curl"
brew "direnv"
brew "gawk"
brew "gcc@13"
brew "gnu-tar"
brew "gpg"
brew "tree"
brew "wget"

# Modern unix tools
brew "bat"
brew "dust"
brew "eza"
brew "fd"
brew "httpie"
brew "jq"
brew "ripgrep"
brew "z"

# Productivity
cask "hammerspoon"
cask "karabiner-elements"
cask "raycast"
brew "starship"

# Cloud
brew "awscli"
brew "aws-vault"
brew "flyctl"
brew "gh"
brew "k9s"
brew "kubectl"
brew "localstack"
brew "rclone"

# Erlang dependencies
brew "fop"
brew "libxslt"
brew "openssl@1.1"
brew "wxwidgets"

# Rails dependencies
brew "libpq"

# PostgreSQL dependencies
brew "icu4c"  # uconv

# Fonts
tap "homebrew/cask-fonts"
cask "font-iosevka-nerd-font"
cask "font-iosevka-term-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-roboto-mono-nerd-font"

# Image and PDF manipulation
cask "basictex"
brew "exiftool"
brew "ghostscript"
brew "imagemagick"
brew "mupdf"
brew "poppler"

# Video editing & player
brew "ffmpeg"
brew "yt-dlp"
cask "vlc"
